{
  "ar": {
    "about_me": {
      "name": "حسين فاضل",
      "title": "مطور حلول تقنية متخصص في الأتمتة وإنترنت الأشياء.",
      "profile_image": "img/me.jpg",
      "tagline": "أترجم الأفكار المبتكرة إلى واقع ملموس، كودًا بكود، وحلاً بحل.",
      "introduction": "مهندس تقني متخصص، أمتلك شغفًا بتحويل التحديات المعقدة إلى حلول عملية وذكية. مسيرتي في عالم التكنولوجيا هي رحلة متواصلة من الابتكار والتطوير، حيث أدمج بين الخبرة الهندسية العميقة والرؤية التصميمية لتقديم حلول ذات تأثير حقيقي. أؤمن بأن كل مشروع هو فرصة لإثبات القدرات وتحقيق إنجاز جديد.",
      "contact_details": {
        "email": "hussein.alali80163@gmail.com",
        "phone": "07830117210",
        "linkedin": "hussein-fadhel-ahmed",
        "address": "البصرة، العراق"
      }
    },
    "my_journey": {
      "title": "الخبرات والمشاريع",
      "intro": "كل محطة في مسيرتي المهنية تمثل إضافة نوعية لخبراتي، وتعزيزًا لقدراتي على مواجهة التحديات وتحقيق الأهداف بكفاءة عالية.",
      "timeline": [
        {
          "type": "education",
          "period": "2021 – 2025",
          "heading": "بكالوريوس هندسة تكنولوجيا التحكم والأتمتة",
          "subheading": "الجامعة التقنية الجنوبية, البصرة",
          "description": "في رحاب الجامعة، وضعت اللبنات الأولى لشغفي التقني. تعمقت في دراسة أنظمة التحكم الدقيقة، واستكشفت الإمكانيات الواسعة للأنظمة المدمجة وتطبيقات الذكاء الاصطناعي. توجت هذه المسيرة بمشروع تخرج طموح يهدف إلى توظيف نماذج اللغة الكبيرة (LLMs) لتطوير حلول مبتكرة في مجال الصيانة التنبؤية، مما يعكس التزامي بتطبيق أحدث التقنيات لمواجهة التحديات الواقعية.",
          "icon": "graduation-cap"
        },
        {
          "type": "experience",
          "period": "يوليو 2024 – أغسطس 2024",
          "heading": "مهندس إنترنت الأشياء ومطور حلول",
          "subheading": "شركة سراج المعرفة, البصرة",
          "description": "خلال هذه التجربة، قمت بتحويل المفاهيم النظرية إلى حلول عملية ملموسة. صممت وطورت نظام تحكم صناعي متكامل، مزودًا بواجهة مستخدم رسومية (GUI) تفاعلية باستخدام KivyMD. هذا النظام لم يسهل فقط عمليات المراقبة والتحكم، بل قدم أيضًا رؤية مبتكرة لإدارة العمليات الصناعية بكفاءة ومرونة.",
          "icon": "briefcase"
        },
        {
          "type": "experience",
          "period": "يوليو 2023 – أغسطس 2024",
          "heading": "أخصائي دعم فني للأجهزة الصناعية",
          "subheading": "شركة العالم الرقمي, البصرة",
          "description": "توليت مسؤولية تشخيص وإصلاح الأعطال في مجموعة متنوعة من الأجهزة الصناعية الحساسة. عملت على ضمان استمرارية العمليات الإنتاجية لعملائنا من خلال تقديم دعم فني سريع وفعال، وتطبيق حلول صيانة وقائية لتقليل الأعطال المستقبلية. هذه التجربة صقلت مهاراتي في حل المشكلات تحت الضغط.",
          "icon": "tools"
        },
        {
          "type": "experience",
          "period": "فترات تدريبية متنوعة",
          "heading": "مهندس SCADA & DCS (تدريب ميداني)",
          "subheading": "قطاع النفط والكهرباء, البصرة",
          "description": "خلال فترات التدريب الميداني في قطاعي النفط والكهرباء، انغمست في بيئات العمل الصناعية الحقيقية. اكتسبت خبرة عملية في معايرة أجهزة القياس والتحكم الدقيقة، وشاركت في تصميم وتطوير واجهات مراقبة (HMI) لأنظمة SCADA و DCS، مما عزز فهمي العميق لمتطلبات التحكم الصناعي وأفضل الممارسات.",
          "icon": "industry"
        },
        {
          "type": "experience",
          "period": "2019 – حتى الآن",
          "heading": "خبير صيانة سيارات (عمل حر)",
          "subheading": "مستقل, البصرة",
          "description": "على مدار أكثر من أربع سنوات، كرست وقتي لدراسة وفهم تعقيدات الأنظمة الميكانيكية والكهربائية في السيارات. هذه الخبرة العملية المستقلة مكنتني من تطوير قدرات تحليلية قوية في تشخيص الأعطال بدقة، وابتكار حلول فعالة ومستدامة لمجموعة واسعة من التحديات التقنية.",
          "icon": "car"
        }
      ]
    },
    "my_toolkit": {
      "title": "المهارات التقنية",
      "intro_text": "مجموعة متكاملة من التقنيات والمهارات التي أتقنها وأوظفها بفعالية لتحويل الأفكار إلى مشاريع ناجحة ومبتكرة:",
      "categories": [
        {
          "name": "الأتمتة وإنترنت الأشياء الصناعي (IIoT)",
          "icon": "cogs",
          "description": "أمتلك خبرة في تصميم وتنفيذ حلول أتمتة صناعية شاملة تربط بين الأنظمة المادية والرقمية. أركز على تحسين كفاءة العمليات، تمكين اتخاذ القرارات المستندة إلى البيانات، وتطوير بنى تحتية ذكية للمصانع والمنشآت الصناعية، مع مراعاة قابلية التوسع والأمان.",
          "skills": [
            {"name": "حلول IIoT", "level_percentage": 90, "details": "خبرة في تصميم وتطوير حلول إنترنت الأشياء الصناعية (IIoT) الشاملة، بدءًا من اختيار وربط المستشعرات والأجهزة الطرفية في البيئة الصناعية، مرورًا بجمع البيانات ونقلها بشكل آمن وفعال، وصولًا إلى تحليل هذه البيانات على منصات سحابية لاستخلاص رؤى قيمة تساهم في تحسين العمليات التشغيلية والصيانة التنبؤية."},
            {"name": "SCADA/DCS", "level_percentage": 85, "details": "كفاءة عالية في تطوير وتهيئة أنظمة التحكم الإشرافي وتحصيل البيانات (SCADA) وأنظمة التحكم الموزعة (DCS) المستخدمة في إدارة العمليات الصناعية المعقدة. يشمل ذلك تصميم واجهات مستخدم رسومية (HMI) بديهية وفعالة تتيح للمشغلين مراقبة العمليات والتحكم فيها بسهولة، بالإضافة إلى تكوين قواعد البيانات التاريخية وتحليل الاتجاهات."},
            {"name": "برمجة PLC", "level_percentage": 95, "details": "إتقان برمجة وحدات التحكم المنطقية القابلة للبرمجة (PLC) لمختلف الشركات المصنعة الرائدة مثل Siemens (TIA Portal, STEP 7) و Allen-Bradley (Studio 5000). يشمل ذلك تطوير تطبيقات التحكم باستخدام لغات البرمجة القياسية IEC 61131-3 مثل Ladder Diagram (LD), Function Block Diagram (FBD), Structured Text (ST), و Sequential Function Chart (SFC)/SCL، وتطبيق أفضل الممارسات لضمان موثوقية وأمان أنظمة التحكم."},
            {"name": "بروتوكولات صناعية", "level_percentage": 80, "details": "فهم عميق وتطبيق عملي لمختلف بروتوكولات الاتصال الصناعية لضمان التشغيل البيني السلس والموثوق بين الأجهزة والمكونات المختلفة في الشبكات الصناعية. خبرة في تكوين واستكشاف أخطاء بروتوكولات شائعة مثل Modbus (RTU/TCP), Profibus (DP/PA), Ethernet/IP, بالإضافة إلى البروتوكولات الحديثة المعتمدة على الخدمات مثل OPC UA التي تدعم الاتصال الآمن والقابل للتوسع."}
          ]
        },
        {
          "name": "الأنظمة المدمجة وتصميم الأجهزة",
          "icon": "microchip",
          "description": "أقوم بتصميم وتطوير الأنظمة المدمجة التي تشكل العقل الإلكتروني للأجهزة الذكية. أتبع منهجية تطوير شاملة تبدأ من تحديد المتطلبات وتحليلها، مرورًا بتصميم الدوائر واختيار المكونات، وصولًا إلى بناء النماذج الأولية واختبارها، مع التركيز الدائم على تحقيق الأداء الأمثل والموثوقية العالية.",
          "skills": [
            {"name": "منصات تطوير", "level_percentage": 95, "details": "خبرة عملية واسعة في استخدام مجموعة متنوعة من منصات تطوير الأنظمة المدمجة، بما في ذلك ESP32 (لتطبيقات إنترنت الأشياء والاتصال اللاسلكي)، Raspberry Pi (للحوسبة الطرفية والتطبيقات التي تتطلب نظام تشغيل)، Arduino (للنماذج الأولية السريعة والمشاريع التعليمية)، و STM32 (للتطبيقات الصناعية والأنظمة التي تتطلب أداءً عاليًا وموثوقية). هذه الخبرة تمكنني من اختيار المنصة المثلى لكل مشروع بناءً على متطلبات الأداء، استهلاك الطاقة، التكلفة، والميزات المطلوبة."},
            {"name": "معالجات ARM الدقيقة", "level_percentage": 75, "details": "فهم جيد لبنى معالجات ARM الدقيقة، بما في ذلك سلسلة Cortex-M (المستخدمة في المتحكمات الدقيقة للتطبيقات منخفضة الطاقة وفي الوقت الحقيقي) وسلسلة Cortex-A (المستخدمة في معالجات التطبيقات التي تتطلب أداءً أعلى وتشغيل أنظمة تشغيل متقدمة). القدرة على تطوير برامج ثابتة (firmware) فعالة ومحسنة لهذه المعالجات باستخدام لغات مثل C/C++."},
            {"name": "تصميم PCB والنماذج", "level_percentage": 85, "details": "مهارة في استخدام برامج تصميم الدوائر الإلكترونية المطبوعة (PCB) مثل Altium Designer و KiCad. يشمل ذلك تحويل المخططات الإلكترونية (Schematics) إلى تصميمات لوحات دوائر مطبوعة (Layouts) فعالة وموثوقة، مع مراعاة قواعد التصنيع (DRC) وسلامة الإشارة. القدرة على بناء واختبار النماذج الأولية للتحقق من صحة التصميم."}
          ]
        },
        {
          "name": "تطوير البرمجيات والذكاء الاصطناعي",
          "icon": "brain",
          "description": "أطور برمجيات قوية وفعالة تبث الحياة في الأنظمة الذكية. أطبق أحدث تقنيات الذكاء الاصطناعي وتعلم الآلة لاستخلاص رؤى قيمة من البيانات، أتمتة المهام المعقدة، وبناء تطبيقات قادرة على التعلم والتكيف. أركز على تطوير حلول AI عملية وقابلة للتطبيق في سياقات متنوعة.",
          "skills": [
            {"name": "Python", "level_percentage": 90, "details": "إتقان شامل للغة بايثون وتطبيقاتها المتنوعة. خبرة في استخدام مكتبات أساسية مثل NumPy لمعالجة المصفوفات العددية، Pandas لتحليل البيانات ومعالجتها، و Matplotlib/Seaborn لإنشاء تصورات بيانية. بالإضافة إلى ذلك، خبرة في مكتبات متخصصة مثل Kivy لتطوير واجهات مستخدم رسومية متعددة المنصات، OpenCV لمعالجة الصور والرؤية الحاسوبية، و TensorFlow/PyTorch لبناء وتدريب نماذج التعلم العميق، و Scikit-learn لتطبيق خوارزميات تعلم الآلة التقليدية."},
            {"name": "LLM و NLP", "level_percentage": 80, "details": "خبرة عملية في تطوير تطبيقات تستفيد من قدرات نماذج اللغة الكبيرة (LLMs) مثل نماذج GPT. يشمل ذلك فهم وتطبيق تقنيات معالجة اللغة الطبيعية (NLP) الأساسية مثل تحليل المشاعر، تصنيف النصوص، والتعرف على الكيانات المسماة. القدرة على دمج هذه النماذج والتقنيات في تطبيقات ذكية تهدف إلى فهم تفاعلات المستخدمين وتقديم استجابات وحلول ملائمة."},
            {"name": "هندسة الأوامر والضبط", "level_percentage": 70, "details": "مهارة متقدمة في هندسة الأوامر (Prompt Engineering)، والتي تتضمن تصميم وصياغة الأوامر (Prompts) بشكل دقيق ومبتكر لتوجيه نماذج اللغة الكبيرة (LLMs) نحو تحقيق النتائج المطلوبة بكفاءة عالية. بالإضافة إلى ذلك، خبرة في تقنيات الضبط الدقيق (Fine-Tuning) للنماذج اللغوية على مجموعات بيانات متخصصة لتحسين أدائها في مهام محددة أو مجالات معرفية معينة، مما يزيد من دقتها وملاءمتها للتطبيق المستهدف."}
          ]
        },
        {
          "name": "تطوير الويب وتجارب المستخدم",
          "icon": "code-branch",
          "description": "أصمم وأطور واجهات مستخدم رقمية (UI) وتجارب مستخدم (UX) تركز على الجاذبية البصرية وسهولة الاستخدام. أهدف إلى إنشاء جسور فعالة تربط المستخدمين بالوظائف الأساسية للتطبيقات والمواقع بسلاسة وبديهية، مما يعزز رضا المستخدم ويحقق أهداف المشروع.",
          "skills": [
            {"name": "HTML5, CSS3", "level_percentage": 90, "details": "إتقان كامل لـ HTML5 لإنشاء هياكل صفحات ويب دلالية ومنظمة، و CSS3 لتصميم وتنسيق واجهات مستخدم جذابة ومتجاوبة. خبرة في استخدام معالجات CSS المتقدمة مثل Sass لتبسيط وتنظيم أكواد CSS، بالإضافة إلى أطر عمل CSS شائعة مثل Tailwind CSS (لنهج Utility-First) و Bootstrap (لتطوير سريع لواجهات متجاوبة)، مما يساهم في تسريع عملية التطوير وضمان تجربة مستخدم متسقة عبر مختلف الأجهزة والمتصفحات."},
            {"name": "JavaScript", "level_percentage": 85, "details": "قدرة قوية على تطوير تطبيقات ويب تفاعلية وديناميكية باستخدام JavaScript الحديثة (ES6 وما بعدها)، بما في ذلك التعامل مع DOM، الأحداث، الطلبات غير المتزامنة (AJAX, Fetch API)، وتخزين البيانات في المتصفح. خبرة جيدة في بناء واجهات مستخدم تفاعلية باستخدام إطار العمل Vue.js، وفهم لأساسيات بناء المكونات وإدارة الحالة في React."},
            {"name": "Firebase و BaaS", "level_percentage": 75, "details": "خبرة في استخدام منصة Firebase كحل Backend-as-a-Service (BaaS) لتطوير تطبيقات ويب وهواتف محمولة بشكل سريع وفعال. يشمل ذلك استخدام خدمات Firebase الأساسية مثل Firestore (لقواعد البيانات NoSQL في الوقت الحقيقي)، Authentication (لإدارة مصادقة المستخدمين)، Cloud Storage (لتخزين الملفات)، و Cloud Functions (لتنفيذ أكواد خلفية بدون خادم). فهم جيد لمزايا منصات BaaS الأخرى وقدرتها على تسريع دورة تطوير التطبيقات."},
            {"name": "تصميم واجهات وتجارب المستخدم", "level_percentage": 80, "details": "مهارة عالية في استخدام أدوات تصميم واجهات المستخدم (UI) وتجربة المستخدم (UX) الرائدة مثل Figma و Adobe XD لإنشاء تصميمات مرئية جذابة ونماذج أولية تفاعلية (Prototypes) عالية الدقة. بالإضافة إلى ذلك، خبرة في تطبيق مبادئ التصميم هذه باستخدام KivyMD لتطوير واجهات مستخدم رسومية لتطبيقات Python. التركيز الدائم على مبادئ تجربة المستخدم الأساسية مثل سهولة الاستخدام، إمكانية الوصول، وتصميم يركز على المستخدم لضمان تجربة سلسة وممتعة."}
          ]
        },
        {
          "name": "الهندسة والتصميم بمساعدة الحاسوب",
          "icon": "drafting-compass",
          "description": "أستخدم مجموعة من الأدوات الرقمية المتقدمة في مجال التصميم بمساعدة الحاسوب (CAD) والمحاكاة الهندسية. هذا يمكنني من تصميم ونمذجة وتحليل الأنظمة الميكانيكية والإلكترونية بدقة وكفاءة عالية، مما يساهم في تقليل الأخطاء وتسريع دورة التطوير.",
          "skills": [
            {"name": "التصميم ثلاثي الأبعاد", "level_percentage": 85, "details": "خبرة قوية في استخدام برامج التصميم بمساعدة الحاسوب (CAD) لإنشاء نماذج ثلاثية الأبعاد دقيقة للمنتجات، المكونات، والتجميعات الميكانيكية. إتقان AutoCAD للتصميم ثنائي وثلاثي الأبعاد، و Fusion 360 للنمذجة البارامترية والتصميم المتكامل، بالإضافة إلى معرفة بأساسيات SolidWorks. القدرة على تحويل الأفكار والمفاهيم إلى تصميمات قابلة للتصنيع والمحاكاة."},
            {"name": "MATLAB/Simulink", "level_percentage": 70, "details": "خبرة في استخدام بيئة MATLAB للتحليل العددي وتطوير الخوارزميات، و Simulink لنمذجة ومحاكاة الأنظمة الديناميكية متعددة المجالات. يشمل ذلك بناء نماذج رياضية للأنظمة الفيزيائية، تصميم واختبار خوارزميات التحكم (مثل PID)، وتحليل أداء الأنظمة قبل تطبيقها عمليًا، مما يساهم في تسريع عملية التطوير وتقليل المخاطر."},
            {"name": "برامج محاكاة", "level_percentage": 80, "details": "إتقان استخدام مجموعة متنوعة من برامج المحاكاة لإنشاء بيئات افتراضية تتيح اختبار وتصحيح أخطاء التصاميم والبرمجيات قبل التنفيذ الفعلي على الأجهزة. خبرة في Factory I/O لمحاكاة أنظمة التحكم الصناعية وتفاعلها مع بيئات المصانع الافتراضية، Multisim و Proteus لمحاكاة الدوائر الإلكترونية التناظرية والرقمية واختبار سلوكها، و Wokwi لمحاكاة مشاريع الأنظمة المدمجة (مثل Arduino و ESP32) وتفاعلها مع المستشعرات والمشغلات الافتراضية."}
          ]
        }
      ]
    },
    "recognitions": {
        "title": "اللغات والشهادات",
        "languages_intro": "أجيد التواصل بفعالية بلغات متعددة، مما يمكنني من العمل بكفاءة في بيئات متنوعة:",
        "languages": [
          { "language": "العربية", "proficiency": "لغة أم بطلاقة تامة", "level_percentage": 100 },
          { "language": "الإنجليزية", "proficiency": "مستوى احترافي متقدم (تقني وتطبيقي)", "level_percentage": 95 }
        ],
        "certificates_intro": "شهادات مهنية تعزز خبراتي وتؤكد التزامي بالتفوق واكتساب أحدث المعارف في مجالي:",
        "certificates": [
          { "name": "النمو مع الذكاء الاصطناعي (جوجل/زين)", "date": "ديسمبر 2024", "issuer_icon": "google", "description": "برنامج مكثف ركز على تطبيقات الذكاء الاصطناعي في نمو الأعمال والابتكار، وكيفية استخدام أدوات Google AI لتطوير حلول ذكية.", "file": "certificates/google_ai_growth.pdf" },
          { "name": "أساسيات لغة C++ (سولوليرن)", "date": "نوفمبر 2024", "issuer_icon": "sololearn", "description": "شهادة تغطي المفاهيم الأساسية للغة C++، بما في ذلك هياكل البيانات، والبرمجة الشيئية، وإدارة الذاكرة، مما يوفر أساسًا متينًا لتطوير البرمجيات عالية الأداء.", "file": "certificates/sololearn_cpp_fundamentals.pdf" },
          { "name": "بايثون متقدم (سولوليرن)", "date": "نوفمبر 2024", "issuer_icon": "sololearn", "description": "تعميق المعرفة بلغة بايثون، واستكشاف مواضيع متقدمة مثل المولدات، والمزخرفات، والبرمجة الوظيفية، وتطبيقاتها في تحليل البيانات وتطوير الويب.", "file": "certificates/sololearn_python_advanced.pdf" },
          { "name": "أساسيات إنترنت الأشياء (معرفة)", "date": "يونيو 2022", "issuer_icon": "maarifa", "description": "مقدمة شاملة لمفاهيم إنترنت الأشياء، بما في ذلك البروتوكولات، والمنصات، والتطبيقات العملية في مختلف القطاعات.", "file": "certificates/maarifa_iot_fundamentals.pdf" },
          { "name": "تطوير تطبيقات الويب (ويبي)", "date": "سبتمبر 2023", "issuer_icon": "webe", "description": "دورة تدريبية عملية حول تطوير تطبيقات الويب الحديثة باستخدام HTML، CSS، JavaScript، مع التركيز على بناء واجهات مستخدم تفاعلية وجذابة.", "file": "certificates/webe_web_development.pdf" },
          { "name": "أساسيات الأردوينو (إدراك)", "date": "ديسمبر 2021", "issuer_icon": "edraak", "description": "تعلم أساسيات العمل مع منصة أردوينو، بما في ذلك برمجة المتحكمات الدقيقة، وتوصيل المستشعرات والمشغلات، لبناء مشاريع إلكترونية تفاعلية.", "file": "certificates/edraak_arduino_essentials.pdf" }
        ]
    },
    "ui_text": {
        "nav_home": "الرئيسية",
        "nav_journey": "الخبرات",
        "nav_toolkit": "المهارات",
        "nav_portfolio": "المشاريع",
        "nav_recognitions": "الشهادات",
        "nav_contact": "تواصل معي",
        "theme_toggle_dark": "ثيم داكن",
        "theme_toggle_light": "ثيم فاتح",
        "hero_greeting": "أهلاً بك، أنا",
        "hero_i_am": "أنا ",
        "hero_cta": "اكتشف المزيد",
        "journey_section_title": "الخبرات والمشاريع السابقة",
        "toolkit_section_title": "المهارات التقنية",
        "recognitions_section_title": "اللغات والشهادات",
        "portfolio_section_title": "أبرز المشاريع",
        "contact_section_title": "لنتعاون في تحقيق رؤيتك لمشروعك القادم!",
        "contact_name_placeholder": "اسمك الكريم",
        "contact_email_placeholder": "بريدك الإلكتروني للرد",
        "contact_message_placeholder": "أخبرني عن فكرتك أو استفسارك...",
        "contact_send_button": "أرسل الآن!",
        "contact_my_linkedin": "تواصل معي على لينكدإن",
        "footer_copyright": " حسين فاضل. جميع الحقوق محفوظة.",
        "error_loading_data": "عفواً، حدث خطأ أثناء تحميل البيانات. الرجاء المحاولة لاحقاً.",
        "contact_form_submitted": "شكراً لك! رسالتك في طريقها إليّ. سأقوم بالرد في أقرب وقت.",
        "sample_3d_element": "نموذج ثلاثي الأبعاد متقدم...",
        "language_toggle_en": "English",
        "language_toggle_ar": "العربية",
        "hero_i_am_specialized_in": "متخصص في",
        "hero_i_master": "أصنع بـ",
        "hero_generic_skill": "مطور حلول تقنية شاملة.",
        "page_title": "حسين فاضل | معرض الأعمال والخبرات",
        "download_cv_button": "تحميل السيرة الذاتية (PDF)",
        "download_certificate_button": "تحميل الشهادة"
    }
  },
  "en": {
    "about_me": {
      "name": "Hussein Fadhel",
      "title": "Technology Solutions Developer specializing in Automation & IoT.",
      "profile_image": "img/me.jpg",
      "tagline": "Translating innovative ideas into tangible realities, code by code, solution by solution.",
      "introduction": "A dedicated technology engineer, I possess a strong passion for transforming complex challenges into practical and intelligent solutions. My career in technology is a continuous journey of innovation and development, where I integrate deep engineering expertise with a strategic design vision to deliver impactful results. I believe every project is an opportunity to demonstrate capabilities and achieve new milestones.",
      "contact_details": {
        "email": "hussein.alali80163@gmail.com",
        "phone": "07830117210",
        "linkedin": "hussein-fadhel-ahmed",
        "address": "Basra, Iraq"
      }
    },
    "my_journey": {
      "title": "Experience & Projects",
      "intro": "Each milestone in my professional journey represents a significant addition to my expertise, enhancing my ability to tackle challenges and achieve objectives with high efficiency.",
      "timeline": [
        {
          "type": "education",
          "period": "2021 – 2025 (Expected)",
          "heading": "B.Sc. in Control & Automation Engineering Technology",
          "subheading": "Southern Technical University, Basra",
          "description": "At university, I laid the initial groundwork for my technical passion. I delved deep into the study of precise control systems and explored the vast potential of embedded systems and AI applications. This journey culminated in an ambitious graduation project aimed at leveraging Large Language Models (LLMs) to develop innovative solutions for predictive maintenance, reflecting my commitment to applying cutting-edge technologies to real-world challenges.",
          "icon": "graduation-cap"
        },
        {
          "type": "experience",
          "period": "July 2024 – August 2024",
          "heading": "IoT Engineer & Solutions Developer",
          "subheading": "Siraj Al-Maarefa Company, Basra",
          "description": "During this experience, I transformed theoretical concepts into tangible, practical solutions. I designed and developed an integrated industrial control system, complete with an interactive Graphical User Interface (GUI) using KivyMD. This system not only facilitated monitoring and control operations but also introduced an innovative approach to managing industrial processes with efficiency and flexibility.",
          "icon": "briefcase"
        },
        {
          "type": "experience",
          "period": "July 2023 – August 2024",
          "heading": "Technical Support Specialist for Industrial Devices",
          "subheading": "Digital World Company, Basra",
          "description": "I took on the responsibility of diagnosing and repairing faults in a variety of sensitive industrial devices. I worked to ensure the continuity of our clients' production operations by providing prompt and effective technical support, and implementing preventive maintenance solutions to minimize future downtime. This experience honed my problem-solving skills under pressure.",
          "icon": "tools"
        },
        {
          "type": "experience",
          "period": "Various Training Periods",
          "heading": "SCADA & DCS Engineer (Field Training)",
          "subheading": "Oil & Electricity Sector, Basra",
          "description": "During field training in the oil and electricity sectors, I immersed myself in real-world industrial environments. I gained hands-on experience in calibrating precise measurement and control instruments and participated in designing and developing Human-Machine Interfaces (HMIs) for SCADA and DCS systems, thereby deepening my understanding of industrial control requirements and best practices.",
          "icon": "industry"
        },
        {
          "type": "experience",
          "period": "2019 – Present",
          "heading": "Automotive Maintenance Expert (Freelance)",
          "subheading": "Independent, Basra",
          "description": "For over four years, I dedicated my time to studying and understanding the complexities of automotive mechanical and electrical systems. This independent, hands-on experience enabled me to develop strong analytical capabilities in accurately diagnosing faults and devising effective, sustainable solutions for a wide range of technical challenges.",
          "icon": "car"
        }
      ]
    },
    "my_toolkit": {
      "title": "Technical Skills",
      "intro_text": "A comprehensive suite of technologies and skills that I master and effectively employ to transform ideas into successful and innovative projects:",
      "categories": [
        {
          "name": "Automation & Industrial IoT (IIoT)",
          "icon": "cogs",
          "description": "I possess expertise in designing and implementing comprehensive industrial automation solutions that bridge physical and digital systems. I focus on enhancing operational efficiency, enabling data-driven decision-making, and developing smart infrastructures for factories and industrial facilities, always considering scalability and security.",
          "skills": [
            {"name": "IIoT Solutions", "level_percentage": 90, "details": "Expertise in designing and developing comprehensive Industrial Internet of Things (IIoT) solutions, from selecting and connecting edge sensors and devices in industrial environments, through secure and efficient data acquisition and transmission, to analyzing this data on cloud platforms to extract valuable insights for operational improvement and predictive maintenance."},
            {"name": "SCADA/DCS Systems", "level_percentage": 85, "details": "High proficiency in developing and configuring Supervisory Control and Data Acquisition (SCADA) and Distributed Control Systems (DCS) used in managing complex industrial processes. This includes designing intuitive and effective Human-Machine Interfaces (HMIs) that allow operators to easily monitor and control operations, as well as configuring historical databases and trend analysis."},
            {"name": "PLC Programming", "level_percentage": 95, "details": "Mastery of Programmable Logic Controller (PLC) programming for various leading manufacturers like Siemens (TIA Portal, STEP 7) and Allen-Bradley (Studio 5000). This includes developing control applications using standard IEC 61131-3 programming languages such as Ladder Diagram (LD), Function Block Diagram (FBD), Structured Text (ST), and Sequential Function Chart (SFC)/SCL, and applying best practices to ensure control system reliability and safety."},
            {"name": "Industrial Protocols", "level_percentage": 80, "details": "Deep understanding and practical application of various industrial communication protocols to ensure seamless and reliable interoperability between different devices and components in industrial networks. Experience in configuring and troubleshooting common protocols like Modbus (RTU/TCP), Profibus (DP/PA), Ethernet/IP, as well as modern service-based protocols like OPC UA supporting secure and scalable communication."}
          ]
        },
        {
          "name": "Embedded Systems & Hardware Design",
          "icon": "microchip",
          "description": "I design and develop embedded systems that form the electronic core of smart devices. I follow a comprehensive development methodology, from requirements gathering and analysis, through circuit design and component selection, to prototype construction and testing, always focusing on optimal performance and high reliability.",
          "skills": [
            {"name": "Development Platforms", "level_percentage": 95, "details": "Extensive hands-on experience with a variety of embedded system development platforms, including ESP32 (for IoT applications and wireless connectivity), Raspberry Pi (for edge computing and applications requiring an OS), Arduino (for rapid prototyping and educational projects), and STM32 (for industrial applications and systems requiring high performance and reliability). This expertise allows me to select the optimal platform for each project based on performance, power consumption, cost, and feature requirements."},
            {"name": "ARM Microcontrollers", "level_percentage": 75, "details": "Good understanding of ARM microcontroller architectures, including the Cortex-M series (used in microcontrollers for low-power, real-time applications) and Cortex-A series (used in application processors requiring higher performance and running advanced operating systems). Ability to develop efficient and optimized firmware for these processors using languages like C/C++."},
            {"name": "PCB Design & Prototyping", "level_percentage": 85, "details": "Skilled in using Printed Circuit Board (PCB) design software such as Altium Designer and KiCad. This includes translating electronic schematics into efficient and reliable PCB layouts, considering Design Rule Checks (DRC) and signal integrity. Capable of building and testing prototypes to validate designs."}
          ]
        },
        {
          "name": "Software Development & Artificial Intelligence",
          "icon": "brain",
          "description": "I develop robust and efficient software that brings intelligent systems to life. I apply the latest AI and machine learning techniques to extract valuable insights from data, automate complex tasks, and build applications capable of learning and adapting. I focus on developing practical and applicable AI solutions in diverse contexts.",
          "skills": [
            {"name": "Python", "level_percentage": 90, "details": "Comprehensive mastery of the Python language and its diverse applications. Experience with core libraries like NumPy for numerical array processing, Pandas for data analysis and manipulation, and Matplotlib/Seaborn for creating data visualizations. Additionally, experience with specialized libraries such as Kivy for developing cross-platform graphical user interfaces, OpenCV for image processing and computer vision, TensorFlow/PyTorch for building and training deep learning models, and Scikit-learn for applying traditional machine learning algorithms."},
            {"name": "LLM & NLP Apps", "level_percentage": 80, "details": "Practical experience in developing applications that leverage the capabilities of Large Language Models (LLMs) such as GPT models. This includes understanding and applying fundamental Natural Language Processing (NLP) techniques like sentiment analysis, text classification, and named entity recognition. Ability to integrate these models and techniques into intelligent applications aimed at understanding user interactions and providing relevant responses and solutions."},
            {"name": "Prompt Engineering & Fine-Tuning", "level_percentage": 70, "details": "Advanced skill in Prompt Engineering, which involves designing and crafting prompts precisely and innovatively to guide Large Language Models (LLMs) towards achieving desired outcomes with high efficiency. Additionally, experience in Fine-Tuning techniques for language models on specialized datasets to enhance their performance on specific tasks or knowledge domains, thereby increasing their accuracy and suitability for the target application."}
          ]
        },
        {
          "name": "Web Development & User Experience",
          "icon": "code-branch",
          "description": "I design and develop digital user interfaces (UI) and user experiences (UX) that prioritize visual appeal and ease of use. I aim to create effective bridges that connect users to the core functionalities of applications and websites smoothly and intuitively, enhancing user satisfaction and achieving project goals.",
          "skills": [
            {"name": "HTML5, CSS3", "level_percentage": 90, "details": "Full proficiency in HTML5 for creating semantic and well-structured web page skeletons, and CSS3 for designing and styling attractive and responsive user interfaces. Experience with advanced CSS preprocessors like Sass to simplify and organize CSS code, as well as popular CSS frameworks like Tailwind CSS (for a utility-first approach) and Bootstrap (for rapid development of responsive interfaces), contributing to faster development and consistent user experience across devices and browsers."},
            {"name": "JavaScript", "level_percentage": 85, "details": "Strong ability to develop interactive and dynamic web applications using modern JavaScript (ES6 and beyond), including DOM manipulation, event handling, asynchronous requests (AJAX, Fetch API), and browser storage. Good experience in building interactive user interfaces using the Vue.js framework, and an understanding of component-based architecture and state management basics in React."},
            {"name": "Firebase & BaaS", "level_percentage": 75, "details": "Experience using the Firebase platform as a Backend-as-a-Service (BaaS) solution for rapid and efficient development of web and mobile applications. This includes utilizing core Firebase services such as Firestore (for real-time NoSQL databases), Authentication (for user authentication management), Cloud Storage (for file storage), and Cloud Functions (for serverless backend code execution). Good understanding of the advantages of other BaaS platforms and their ability to accelerate the application development lifecycle."},
            {"name": "UI/UX Design", "level_percentage": 80, "details": "High skill in using leading User Interface (UI) and User Experience (UX) design tools such as Figma and Adobe XD to create visually appealing designs and high-fidelity interactive prototypes. Additionally, experience in applying these design principles using KivyMD for developing graphical user interfaces for Python applications. Consistent focus on core UX principles like usability, accessibility, and user-centered design to ensure a seamless and enjoyable experience."}
          ]
        },
        {
          "name": "CAD & Engineering Simulation",
          "icon": "drafting-compass",
          "description": "I employ a range of advanced digital tools in Computer-Aided Design (CAD) and engineering simulation. This enables me to design, model, and analyze mechanical and electronic systems with high precision and efficiency, contributing to error reduction and a faster development cycle.",
          "skills": [
            {"name": "3D Design", "level_percentage": 85, "details": "Strong experience in using Computer-Aided Design (CAD) software to create accurate 3D models of products, components, and mechanical assemblies. Proficiency in AutoCAD for 2D and 3D design, Fusion 360 for parametric modeling and integrated design, and foundational knowledge of SolidWorks. Ability to transform ideas and concepts into manufacturable and simulatable designs."},
            {"name": "MATLAB/Simulink", "level_percentage": 70, "details": "Experience using the MATLAB environment for numerical analysis and algorithm development, and Simulink for modeling and simulating multi-domain dynamic systems. This includes building mathematical models of physical systems, designing and testing control algorithms (like PID), and analyzing system performance before practical implementation, which helps accelerate development and reduce risks."},
            {"name": "Simulation Software", "level_percentage": 80, "details": "Proficiency in using a variety of simulation software to create virtual environments that allow for testing and debugging of designs and software before actual hardware implementation. Experience with Factory I/O for simulating industrial control systems and their interaction with virtual factory environments, Multisim and Proteus for simulating analog and digital electronic circuits and testing their behavior, and Wokwi for simulating embedded systems projects (like Arduino and ESP32) and their interaction with virtual sensors and actuators."}
          ]
        }
      ]
    },
     "recognitions": {
        "title": "Languages & Certifications",
        "languages_intro": "I communicate effectively in multiple languages, enabling me to work efficiently in diverse environments:",
        "languages": [
          { "language": "Arabic", "proficiency": "Native & Full Fluency", "level_percentage": 100 },
          { "language": "English", "proficiency": "Advanced Professional Level (Technical & Applied)", "level_percentage": 95 }
        ],
        "certificates_intro": "Professional certifications that bolster my expertise and underscore my commitment to excellence and acquiring the latest knowledge in my field:",
        "certificates": [
          { "name": "Growth with AI (Google/Zain)", "date": "December 2024", "issuer_icon": "google", "description": "An intensive program focused on AI applications for business growth and innovation, and how to use Google AI tools to develop smart solutions.", "file": "certificates/google_ai_growth.pdf" },
          { "name": "C++ Fundamentals (Sololearn)", "date": "November 2024", "issuer_icon": "sololearn", "description": "A certificate covering core C++ concepts, including data structures, object-oriented programming, and memory management, providing a solid foundation for high-performance software development.", "file": "certificates/sololearn_cpp_fundamentals.pdf" },
          { "name": "Python Advanced (Sololearn)", "date": "November 2024", "issuer_icon": "sololearn", "description": "Deepened Python knowledge, exploring advanced topics like generators, decorators, functional programming, and their applications in data analysis and web development.", "file": "certificates/sololearn_python_advanced.pdf" },
          { "name": "IoT Fundamentals (Maarifa)", "date": "June 2022", "issuer_icon": "maarifa", "description": "A comprehensive introduction to Internet of Things concepts, including protocols, platforms, and practical applications across various sectors.", "file": "certificates/maarifa_iot_fundamentals.pdf" },
          { "name": "Web Development (Webe)", "date": "September 2023", "issuer_icon": "webe", "description": "A hands-on training course on modern web application development using HTML, CSS, JavaScript, with a focus on building interactive and engaging user interfaces.", "file": "certificates/webe_web_development.pdf" },
          { "name": "Arduino Essentials (Edraak)", "date": "December 2021", "issuer_icon": "edraak", "description": "Learned the fundamentals of working with the Arduino platform, including microcontroller programming, connecting sensors and actuators, to build interactive electronic projects.", "file": "certificates/edraak_arduino_essentials.pdf" }
        ]
    },
    "ui_text": {
        "nav_home": "Home",
        "nav_journey": "Experience",
        "nav_toolkit": "Skills",
        "nav_portfolio": "Projects",
        "nav_recognitions": "Certifications",
        "nav_contact": "Connect",
        "theme_toggle_dark": "Dark Theme",
        "theme_toggle_light": "Light Theme",
        "hero_greeting": "Hello, I'm",
        "hero_i_am": "I am ",
        "hero_cta": "Discover More",
        "journey_section_title": "Past Experience & Projects",
        "toolkit_section_title": "Technical Skills",
        "recognitions_section_title": "Languages & Certifications",
        "portfolio_section_title": "Featured Projects",
        "contact_section_title": "Let's collaborate to realize the vision for your next project!",
        "contact_name_placeholder": "Your Esteemed Name",
        "contact_email_placeholder": "Your Email for My Reply",
        "contact_message_placeholder": "Tell me about your idea or query...",
        "contact_send_button": "Send Now!",
        "contact_my_linkedin": "Connect with me on LinkedIn",
        "footer_copyright": " Hussein Fadhel. All rights reserved.",
        "error_loading_data": "Apologies, an error occurred while loading data. Please try again later.",
        "contact_form_submitted": "Thank you! Your message is on its way. I'll get back to you soon.",
        "sample_3d_element": "Advanced 3D Model Showcase...",
        "language_toggle_en": "English",
        "language_toggle_ar": "العربية",
        "hero_i_am_specialized_in": "Specialized in",
        "hero_i_master": "I craft with",
        "hero_generic_skill": "Developer of comprehensive tech solutions.",
        "page_title": "Hussein Fadhel | Portfolio & Experience",
        "download_cv_button": "Download CV (PDF)",
        "download_certificate_button": "Download Certificate"
    }
  }
}